{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "padding": "valid", "batch_input_shape": [null, 1, 55, 30], "bias_constraint": null, "filters": 30, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv1", "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "pool1", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "bias_constraint": null, "filters": 15, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2", "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "pool2", "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}}, {"class_name": "Dense", "config": {"units": 128, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "fc1", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 50, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "fc2", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 10, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "predictions", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "activity_regularizer": null}}], "backend": "tensorflow"}